BEGIN;


INSERT INTO restaurant_app.users (name, surname, phone, email, address, payment) VALUES
('Никита', 'Буянов', '+89987654321', 'support@battlestategames.com', 'г Санкт-Петербург,пр-кт Бакунина, 5А', 'example_token'),
('Александр', 'Ильин', '+79987654331', 'alex.ilin@example.com', 'г Москва, ул Тверская, д 12', 'example_token'),
('Мария', 'Куликова', '+79987654332', 'mariya.kulikova@example.com', 'г Новосибирск, ул Ленина, д 18', 'example_token'),
('Дмитрий', 'Фролов', '+79987654333', 'dmitry.frolov@example.com', 'г Екатеринбург, ул Малышева, д 22', 'example_token'),
('Ольга', 'Петрова', '+79987654334', 'olga.petrov@example.com', 'г Казань, ул Баумана, д 25', 'example_token'),
('Иван', 'Смирнов', '+79987654335', 'ivan.smirnov@example.com', 'г Самара, ул Чапаевская, д 30', 'example_token'),
('Елена', 'Васильева', '+79987654336', 'elena.vasileva@example.com', 'г Ростов-на-Дону, ул Большая, д 35', 'example_token'),
('Константин', 'Марков', '+79987654337', 'konstantin.markov@example.com', 'г Уфа, ул Октябрьской революции, д 40', 'example_token'),
('Надежда', 'Громова', '+79987654338', 'nadezhda.gromova@example.com', 'г Владивосток, ул Светлана, д 45', 'example_token'),
('Владимир', 'Кузнецов', '+79987654339', 'vladimir.kuznetsov@example.com', 'г Пенза, ул Карла Маркса, д 50', 'example_token'),
('Юлия', 'Лебедева', '+79987654340', 'yulia.lebedyeva@example.com', 'г Барнаул, ул Советская, д 55', 'example_token'),
('Роман', 'Баранов', '+79987654341', 'roman.baranoff@example.com', 'г Воронеж, ул Ленина, д 60', 'example_token'),
('Алина', 'Попова', '+79987654342', 'alina.popova@example.com', 'г Мурманск, ул Мартеновская, д 65', 'example_token'),
('Михаил', 'Григорьев', '+79987654343', 'mikhail.grigoryev@example.com', 'г Омск, ул Лермонтова, д 70', 'example_token'),
('Татьяна', 'Родионова', '+79987654344', 'tatyana.rodionova@example.com', 'г Краснодар, ул Красная, д 75', 'example_token'),
('Сергей', 'Белов', '+79987654345', 'sergey.belov@example.com', 'г Ульяновск, ул Ленина, д 80', 'example_token');

INSERT INTO restaurant_app.companies (company_name, franchise_name) VALUES
('ЛДПР', 'Суши ihsuyuH'),
('АО КрУтЫе ПаРнИ', 'БлёвБургер'),
('ООО Battlestate Games Limited', 'Крутая Шавуха'),
('ОАО Ах Ах Ах', 'Малыши-Пельмеши'),
('ЗАО БеЩёки', 'FCK');

INSERT INTO restaurant_app.restaurants (company_id, restaurant_size, address) VALUES
(1, 200, 'ул. Ильи Мэддисона , д. 14'),
(2, 150, 'ул. Кальмарная , д. 228'),
(2, 300, 'ул. Техническая , д. 4'),
(3, 50, 'ул. Бяновский Вал, д. 0.12'),
(4, 500, 'ул. Первертная, д. 33'),
(4, 800, 'ул. Докинг Патрнёрная, д. 2'),
(5, 830, 'ул. Кентукская, д. 9'),
(5, 390, 'ул. Копчёная, д. 3'),
(5, 500, 'ул. Петушинная, д. 123'),
(5, 1000, 'ул. Молльная, д. 10');

INSERT INTO restaurant_app.restaurant_menu (restaurant_id, name, price, discount, is_temporary) VALUES
(1, 'Сакэ', 500, 0, FALSE),
(1, 'Ролл Великая Россия', 1000, 0, FALSE),
(1, 'Соевый соус', 30, 0, FALSE),
(1, 'Пожилой кРолл', 700, 0, FALSE),
(2, 'Блёвбургер', 300, 0, FALSE),
(2, 'Кальмар с солью', 900, 0, FALSE),
(2, 'Стакан Мотчи ', 100, 0, FALSE),
(2, 'КОМБО С наггетсом РЕАЛЬНО офигенно', 300, 0, FALSE),
(3, 'Блёвбургер', 300, 0, FALSE),
(3, 'Кальмар с солью', 900, 0, FALSE),
(3, 'Стакан Мотчи ', 100, 0, FALSE),
(3, 'КОМБО С наггетсом РЕАЛЬНО офигенно', 300, 0, FALSE),
(4, 'Шавуха', 30000, 0, FALSE),
(5, 'Пельмень', 100, 0, FALSE),
(5, 'Варенник', 100, 0, FALSE),
(5, 'пельмень с бульёном', 105, 0, FALSE),
(5, 'Позы', 120, 0, TRUE),
(6, 'Пельмень', 100, 0, FALSE),
(6, 'Варенник', 100, 0, FALSE),
(6, 'пельмень с бульёном', 105, 0, FALSE),
(6, 'Позы', 120, 0, TRUE),
(7, 'Кока-Коля', 30, 0, FALSE),
(7, 'Стрыпс', 100, 0, FALSE),
(7, 'Курича-Бэргер', 199, 0, FALSE),
(8, 'Кока-Коля', 30, 0, FALSE),
(8, 'Стрыпс', 100, 0, FALSE),
(8, 'Курича-Бэргер', 199, 0, FALSE),
(9, 'Кока-Коля', 30, 0, FALSE),
(9, 'Стрыпс', 100, 0, FALSE),
(9, 'Курича-Бэргер', 199, 0, FALSE),
(10, 'Кока-Коля', 30, 0, FALSE),
(10, 'Стрыпс', 100, 0, FALSE),
(10, 'Курича-Бэргер', 199, 0, FALSE);
        
COMMIT;