BEGIN;


INSERT INTO restaurant_app.companies (company_name, franchise_name) VALUES
('ЛДПР', 'Суши ihsuyuH'),
('АО КрУтЫе ПаРнИ', 'БлёвБургер'),
('ООО Battlestate Games Limited', 'Крутая Шавуха'),
('ОАО Ах Ах Ах', 'Малыши-Пельмеши'),
('ЗАО БеЩёки', 'FCK');

INSERT INTO restaurant_app.restaurants (company_id, terminals_amount, restaurant_size, address) VALUES
(1, 4, 200, 'ул. Ильи Мэддисона , д. 14'),
(2, 3, 150, 'ул. Кальмарная , д. 228'),
(2, 5, 300, 'ул. Техническая , д. 4'),
(3, 1, 50, 'ул. Бяновский Вал, д. 0.12'),
(4, 2, 500, 'ул. Первертная, д. 33'),
(4, 4, 800, 'ул. Докинг Патрнёрная, д. 2'),
(5, 4, 830, 'ул. Кентукская, д. 9'),
(5, 3, 390, 'ул. Копчёная, д. 3'),
(5, 4, 500, 'ул. Петушинная, д. 123'),
(5, 6, 1000, 'ул. Молльная, д. 10');

INSERT INTO restaurant_app.restaurant_menu (restaurant_id, item, price, discount, is_temporary) VALUES
(1, 'Сакэ', 500, 0, FALSE),
(1, 'Ролл Великая Россия', 1000, 0, FALSE),
(1, 'Соевый соус', 30, 0, FALSE),
(1, 'Пожилой кРолл', 700, 0, FALSE),
(2, 'Блёвбургер', 300, 0, FALSE),
(2, 'Кальмар с солью', 900, 0, FALSE),
(2, 'Стакан Мотчи ', 100, 0, FALSE),
(2, 'КОМБО С наггетсом РЕАЛЬНО офигенно', 300, 0, FALSE),
(3, 'Блёвбургер', 300, 0, FALSE),
(3, 'Кальмар с солью', 900, 0, FALSE),
(3, 'Стакан Мотчи ', 100, 0, FALSE),
(3, 'КОМБО С наггетсом РЕАЛЬНО офигенно', 300, 0, FALSE),
(4, 'Шавуха', 30000, 0, FALSE),
(5, 'Пельмень', 100, 0, FALSE),
(5, 'Варенник', 100, 0, FALSE),
(5, 'пельмень с бульёном', 105, 0, FALSE),
(5, 'Позы', 120, 0, TRUE),
(6, 'Пельмень', 100, 0, FALSE),
(6, 'Варенник', 100, 0, FALSE),
(6, 'пельмень с бульёном', 105, 0, FALSE),
(6, 'Позы', 120, 0, TRUE),
(7, 'Кока-Коля', 30, 0, FALSE),
(7, 'Стрыпс', 100, 0, FALSE),
(7, 'Курича-Бэргер', 199, 0, FALSE),
(8, 'Кока-Коля', 30, 0, FALSE),
(8, 'Стрыпс', 100, 0, FALSE),
(8, 'Курича-Бэргер', 199, 0, FALSE),
(9, 'Кока-Коля', 30, 0, FALSE),
(9, 'Стрыпс', 100, 0, FALSE),
(9, 'Курича-Бэргер', 199, 0, FALSE),
(10, 'Кока-Коля', 30, 0, FALSE),
(10, 'Стрыпс', 100, 0, FALSE),
(10, 'Курича-Бэргер', 199, 0, FALSE);
        
COMMIT;